package cc.pp.sina.common;

import java.util.HashMap;

public class EmotionType {
	
	// 期待
	private final String EXPECT = "[馋嘴],[礼物],[加油啊],[许愿],[求关注],[花心],[太阳],[饞嘴],[绿丝带]," //
			+ "[奋斗],[星星],[禮物],[蠟燭]";
	
	// 高兴
	private final String PLEASED = "[good],[耶],[鼓掌],[酷],[太开心],[偷笑],[哈哈],[飞个吻],[得瑟]," //
			+ "[笑哈哈],[呵呵],[嘻嘻],[挤眼],[陶醉了],[鞭炮],[c得意],[放鞭炮],[呲牙],[淘气],[唱歌],"//
			+ "[给劲],[ok],[拍手],[c坏笑],[好得意],[钱],[握手],[干杯],[哇哈哈],[阳光],[花],"//
			+ "[得意地笑],[太開心],[乐乐],[c壞笑],[hold住],[鲜花],[跳舞花],[dino撒花],[ala嘿嘿嘿],"//
			+ "[nono眨眼],[彩虹],[c甩舌头]";
	
	// 喜爱
	private final String LOVE = "[赞],[蛋糕],[心],[抱抱],[亲亲],[爱你],[可爱],[亲一口],[牛],[威武],"//
			+ "[给力],[糖果],[雷锋],[雷鋒],[亲],[親親],[好喜歡],[c正经],[萌翻],[擠眼],[推荐],"//
			+ "[飞吻],[赞啊],[nono星星眼],[爱心传递],[ppb卖萌],[帅],[萌],[顶],[dino羞],"//
			+ "[羞嗒嗒],[爱],[温暖帽子],[好爱哦],[玫瑰],[好喜欢],[ppb賣萌],[强吻],[顶啊],[同意],"//
			+ "[好愛哦],[星星眼],[膜拜了],[星],[c摇头萌],[j撒娇],[害羞],[羞羞]";
	
	// 惊讶
	private final String AMAZED = "[黑线],[汗],[吃惊],[黑线],[toto狂汗],[巨汗],[骷髅],[非常汗],[黑線],"//
			+ "[闪电],[霹雳]";
	
	// 恐惧
	private final String FEAR = "[抓狂],[困呀],[委屈],[g头晕],[可怜],[凌乱],[困死了],[有鸭梨],[不好意思],"//
			+ "[可憐],[崩溃],[bed凌乱],[好困],[抓沙发],[我错了],[震惊],[惊恐]";
	
	// 悲伤
	private final String SAD = "[伤心],[衰],[生病],[泪],[囧],[失望],[泪流满面],[蜡烛],[淚],[c捂脸],"//
			+ "[c悲催],[好囧],[不活了],[呜呜],[眼泪],[淚流滿面],[nono哭],[悲催],[悲傷],[c震惊哭],"//
			+ "[j挂了],[傷心],[c伤心]";
	
	// 愤怒
	private final String ANGER = "[不要],[哼],[怒],[左哼哼],[右哼哼],[懒的理你],[别烦我],[做鬼脸],"//
			+ "[bofu累],[扯脸],[愤怒],[c发火],[怒骂]";
	
	// 厌恶
	private final String DISGUST = "[猪头],[挖鼻屎],[阴险],[陰險],[满眼都是钱],[吐],[草泥马],[推撞],"//
			+ "[鄙视],[弱],[闭嘴],[萌萌鄙视],[鄙視],[豬頭],[扔鸡蛋],[猥琐],[抠鼻屎],[c无语],"//
			+ "[NO],[c挖鼻孔]";
	
	// 中性
	private final String NEUTRAL = "[围观],[群体围观],[思考],[拜拜],[兔子],[浮云],[睡觉],[熊猫],"//
			+ "[打哈欠],[话筒],[月亮],[疑问],[雪],[微风],[嘘],[来],[困],[叶子],[拳头],[飛機]"//
			+ ",[感叹号],[被电],[j来嘛],[c摇头看],[bed练腰],[神马],[转载],[手套],[飞机],[雪人],"//
			+ "[咖啡],[下雨],[落叶],[照相机],[钟],[互粉],[织],[哎呦熊撒欢],[汽车],[围脖],[吃驚],"//
			+ "[音乐盒],[音乐],[转发],[自行车],[j哎呀],[nono水汪汪],[bofu咸蛋超人],[冰棍],[风扇],"//
			+ "[漫雨动漫],[视频],[奧特曼],[圍觀],[c摇摆],[免费],[漩涡],[巨蟹],[dx拍拍手],[闪闪灰],"//
			+ "[评论],[北京],[变花],[km黑块旋转],[省略号],[nono无语],[雾],[喇叭],[km唔],[酒],"//
			+ "[足球],[冻结],[c冷眼],[甩甩手],[叹号],[白云],[电影],[話筒],[打哈氣],[c左右看],"//
			+ "[转],[冒个泡],[茶],[bed蹬腿],[大巴],[群体围观],[灌水表情],[熊貓]";

	private final HashMap<String, String> emotions;

	public EmotionType() {
		emotions = new HashMap<String, String>();
		emotions.put("expect", EXPECT);
		emotions.put("please", PLEASED);
		emotions.put("love", LOVE);
		emotions.put("amazed", AMAZED);
		emotions.put("fear", FEAR);
		emotions.put("sad", SAD);
		emotions.put("anger", ANGER);
		emotions.put("disgust", DISGUST);
		emotions.put("neutral", NEUTRAL);
	}

	public HashMap<String, String> getEmotions() {
		return emotions;
	}

}
